In [84]:
import pandas as pd

In [137]:
df = pd.DataFrame([('a', 'b', 'c'), ('b', 'd'), ('a', 'b')])
df.columns = ['a', 'b', 'c']

In [163]:
d = pd.DataFrame([(1,2,2), (2,5, -1), (2,4)])
d.columns = ['a', 'b', 'c']

In [154]:
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      int64
 2   c       2 non-null      float64
dtypes: float64(1), int64(2)
memory usage: 200.0 bytes

In [155]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      object
 1   b       3 non-null      object
 2   c       3 non-null      bool
 3   d       3 non-null      bool
dtypes: bool(2), object(2)
memory usage: 182.0+ bytes

In [156]:
df

   a  b      c      d
0  a  b   True   True
1  b  d  False  False
2  a  b  False  False

In [164]:
d

   a  b    c
0  1  2  2.0
1  2  5 -1.0
2  2  4  NaN

In [188]:
d.groupby('a')

In [180]:
d['d'] = d.groupby('a').transform(lambda x: x)#(x['b'] / x['c']).mean())#.reset_index(drop=True)

In [175]:
d

   a  b    c    d
0  1  2  2.0  2.0
1  2  5 -1.0  4.5
2  2  4  NaN  4.5

In [199]:
d[['a', 'b']]

   a  b
0  1  2
1  2  5
2  2  4

In [197]:
d.groupby('a')['b'].apply(lambda x: x.mean()).reset_index()

   a    b
0  1  2.0
1  2  4.5

In [201]:
print(3,5, sep=',')

3,5

In [139]:
df['d'] = df['c'].astype(bool)

In [149]:
df

   a  b      c      d
0  a  b   True   True
1  b  d  False  False
2  a  b  False  False

In [150]:
d

   a  b    c
0  1  2  0.0
1  4  5 -1.0
2  2  4  NaN

In [151]:
d['c'] = d['c'].astype(bool)

In [152]:
d

   a  b      c
0  1  2  False
1  4  5   True
2  2  4   True

In [142]:
df['c'] = df['c'].astype(bool)

In [143]:
df

   a  b      c      d
0  a  b   True   True
1  b  d  False  False
2  a  b  False  False

In [113]:
df2 = df[['b', 'c']]

In [114]:
df2

   b    c
0  2  3.0
1  5  6.0
2  0  NaN

In [115]:
df2['c'] = 1000

<ipython-input-115-3cdc3a2f7bc8>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['c'] = 1000

In [116]:
df2

   b     c
0  2  1000
1  5  1000
2  0  1000

In [117]:
df

   a  b    c
0  1  2  3.0
1  4  5  6.0
2  7  0  NaN

In [118]:
df['c'] = 100

In [119]:
df

   a  b    c
0  1  2  100
1  4  5  100
2  7  0  100

In [77]:
df[df['a'] == 7]['b'] = 100

<ipython-input-77-8d32d846cb20>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[df['a'] == 7]['b'] = 100

In [102]:
df2[2] = 1000

<ipython-input-102-59c2f4e48177>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2[2] = 1000

In [103]:
df

   a  b       c
0  1  2     3.0
1  4  5     6.0
2  7  0  1000.0

In [104]:
df3 = df.loc[:, 'c']

In [105]:
df3

0       3.0
1       6.0
2    1000.0
Name: c, dtype: float64

In [106]:
df3[2] = 1

<ipython-input-106-a3270932f9c2>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3[2] = 1

In [107]:
df3

0    3.0
1    6.0
2    1.0
Name: c, dtype: float64

In [108]:
df

   a  b    c
0  1  2  3.0
1  4  5  6.0
2  7  0  1.0